{
  "users": [
    {
      "id": 1,
      "email": "antonio@mail.com",
      "password": "123456",
      "name": "Antônio Silva Dauro",
      "bio": "Eu sou um homem apaixonado por artesanato e sustentabilidade. Sempre me interessei por técnicas manuais e criativas e gosto de transformar materiais reciclados em peças únicas e bonitas.",
      "profile_pic": "https://s2.glbimg.com/OKvApQkLyts-Zku_PYt5dqHKm2Q=/620x466/e.glbimg.com/og/ed/f/original/2020/08/27/arnaldosaccomanitv_10852559_624443207678380_964291240_n.jpg",
      "social_media": {
        "instagram": "https://www.instagram.com/arnaldo",
        "linkedin": "https://www.linkedin.com/in/arnaldo/"
      }
    }
  ],
  "ideas": [
    {
      "id": 1,
      "userId": 1,
      "title": "Mesa de canto de cabide",
      "imgs": [
        "https://i.pinimg.com/564x/0a/d1/14/0ad1149d75165b6fdb349fe157e90bd2.jpg",
        "https://i.pinimg.com/564x/be/b3/dc/beb3dc0edfc65daa5588032769bfa61b.jpg"
      ],
      "description": "Uma mesa de canto feita com cabides é uma peça criativa e funcional que pode ser usada em qualquer cômodo da casa. Ela é feita de cabides, um material resistente e versátil, e é projetada para ocupar um canto da parede, economizando espaço e adicionando um toque de estilo ao ambiente.",
      "steps": "1- Comece escolhendo os cabides que você vai usar. É importante escolher cabides resistentes e de tamanho adequado para suportar o peso da mesa. Se quiser, pode misturar cabides de diferentes cores ou modelos para criar um visual mais interessante.\n2- Use a tesoura para cortar os cabides no tamanho desejado. Você vai precisar de um cabide para cada lado da mesa e um ou dois para o fundo, dependendo do tamanho da mesa.\n3- Se quiser, você pode colocar um pedaço de papelão ou madeira no topo da mesa para criar uma superfície plana. Isso vai dar mais estabilidade à mesa e torná-la mais fácil de usar.\n4- Posicione os cabides no canto da parede onde você quer colocar a mesa. Marque os pontos onde os cabides vão ser fixados na parede com um lápis.\n5- Use a furadeira para fazer os furos na parede nos pontos marcados. Encaixe os rebites ou parafusos nos furos e fixe os cabides na parede.\n6- Por fim, coloque o papelão ou a madeira no topo dos cabides e ajuste a mesa para que fique nivelada. Se quiser, você pode acrescentar outros detalhes, como prateleiras ou gavetas, a gosto.",
      "materials": [
        "Cabide",
        "Parafuso",
        "Furadeira",
        "Tesoura",
        "Madeira",
        "Papelão"
      ],
      "categories": ["Móveis", "Rústico"],
      "estimated_cost": 20.0,
      "difficulty_level": 5
    },
    {
      "id": 2,
      "userId": 1,
      "title": "Bolsa de calça jeans",
      "imgs": [
        "https://i.pinimg.com/564x/b4/40/7c/b4407c695cbc7655d56d0a67e78c5546.jpg",
        "https://i.pinimg.com/564x/f4/a2/f5/f4a2f5df0b93aaa506026ded31615df1.jpg",
        "https://i.pinimg.com/564x/e6/35/ec/e635ec2870bef8111935c6bb31ab2d08.jpg"
      ],
      "description": "Essa bolsa é uma peça artesanal feita de calça jeans reciclada e é perfeita para quem busca um acessório prático e ecológico. Feita à mão, ela possui detalhes únicos e um estilo despojado e descontraído. As alças são confortáveis e resistentes, permitindo que a bolsa seja usada em diversas ocasiões. Ela tem um tamanho médio, o suficiente para carregar os itens essenciais, como celular, carteira e chaves. Além disso, como é feita de calça jeans, ela é resistente e durável, ideal para uso diário.",
      "steps": "1- Comece cortando a calça jeans ao meio, ao longo da costura lateral. Você vai usar as duas metades para criar a frente e o fundo da bolsa.\n2- Desvire as duas metades da calça e coloque-as com o lado avesso para cima. Corte o tecido extra das pernas, deixando cerca de 2 centímetros de margem em todos os lados.\n3- Use a fita métrica ou régua para medir a largura e altura da bolsa. Desenhe um retângulo no papel ou papelão com essas medidas e use-o como guia para cortar o tecido da bolsa.\n4- Posicione o tecido da bolsa com o lado direito para cima e coloque as duas metades da calça jeans por cima, também com o lado direito para cima. Alinhe as bordas e costure as duas metades da calça jeans ao tecido da bolsa, deixando uma abertura para virar a bolsa do avesso.\n5- Depois de costurar, vire a bolsa do avesso pela abertura e puxe o tecido para que fique bem esticado. Costure a abertura fechando a bolsa.\n6- Por fim, corte uma tira de tecido da calça jeans e costure-a ao longo da parte superior da bolsa para criar alças. Se quiser, você também pode acrescentar bolsos externos ou outros detalhes a gosto.",
      "materials": ["Jeans", "Régua", "Linha", "Caneta", "Papel"],
      "categories": ["Bolsa", "Reciclagem", "Roupa"],
      "estimated_cost": 10,
      "difficulty_level": 4
    },
    {
      "id": 3,
      "userId": 1,
      "title": "Jarro com palitos de picolé",
      "imgs": [
        "http://2.bp.blogspot.com/-5ljgigoDBOo/UkA5bck-MAI/AAAAAAAAGJU/cWxIfPzQ4W8/s1600/mini+arranjo+para+casamento+(11).jpg",
        "http://img.com/img-2.png",
        "http://3.bp.blogspot.com/-eB9D1l8HiYk/UkA5bilUmhI/AAAAAAAAGJQ/QshDpt3smj4/s1600/mini+arranjo+para+casamento+(1).jpg",
        "http://1.bp.blogspot.com/-upzvRRWI5Io/UkA5gASzaCI/AAAAAAAAGKY/nuMJCN6iz2g/s1600/mini+arranjo+para+casamento+(3).jpg"
      ],
      "description": "O jarro é feito de latinha, um material durável e reciclável, e é coberto por palitos de picolé, que são usados para dar um toque de cor e textura à peça.\nEsse jarro pode ser usado tanto em ambientes internos quanto externos e é perfeito para quem gosta de decorações criativas e ecológicas. Ele pode ser usado para exibir uma variedade de flores e plantas, criando um visual bonito e acolhedor. Além disso, como é feito de latinha e palitos de picolé, ele é muito fácil de fazer.",
      "steps": "1- Colocar os palitos um ao lado do outro sobre a mesa\n2- Cubrir a parte dos palitos virada pra cima com a fita dupla face\n3- Envolver a lata com a parte colante dos palitos, fixando-os nela\n4-Inserir a fita de renda em torno do jarro",
      "materials": ["Palito", "Lata", "Fita dupla face", "Renda"],
      "categories": ["Jarro", "Reciclagem", "Fofo"],
      "estimated_cost": 5,
      "difficulty_level": 1
    }
  ]
}
